app/views/users/show.html.erb

<ul id="user-search-list">
<% @user.searches.reverse.each do |s| %>
---
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = $1  [["user_id", 1]]