app/controllers/recommendations_controller.rb

  def index
    if params[:user_search] || params[:trend_or_location] || params[:category]
      search = params[:user_search] unless params[:user_search] == nil
      trend_or_location = params[:trend_or_location] unless params[:trend_or_location] == nil
      category = params[:category] unless params[:category] == nil
      @recommendations = Recommendation.search(
        search,
        trend_or_location,
        category
        ).sort_by { |rec| rec.score }.reverse
---
SELECT "recommendations".* FROM "recommendations" WHERE (query ilike '%%' AND trend_or_location ilike '%%' AND category ilike '%%')

  def show
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @recommendation = Recommendation.find(params[:id])
    if current_user && @recommendation.user_id == current_user.id
      if @recommendation.update_attributes(recommendation_params)
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recommendations" SET "description" = $1 WHERE "recommendations"."id" = $2  [["description", "interesting to see whats going on in boston"], ["id", 1]]

  def create
    @recommendation = Recommendation.new(recommendation_params)
    @recommendation.user_id = current_user.id
    if @recommendation.save
---
INSERT INTO "recommendations" ("query", "trend_or_location", "category", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["query", "Boston"], ["trend_or_location", "Location"], ["category", "Sports and Entertainment"], ["description", "interesting to see whats going on near me"], ["user_id", 1]]

  def upvote
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 1]]

  def downvote
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 1]]