app/controllers/tweets_controller.rb

  def index
    client = Twitter::REST::Client.new do |config|
      config.consumer_key        = ENV["TWITTER_CONSUMER_KEY"]
      config.consumer_secret     = ENV["TWITTER_CONSUMER_SECRET"]
      config.access_token        = ENV["TWITTER_ACCESS_TOKEN"]
      config.access_token_secret = ENV["TWITTER_ACCESS_SECRET"]
    end

    if params[:search]
      query = params[:search]
      @tweets = client.search("##{query}").take(25)
      if current_user
        Search.create(query: params[:search], trend_or_location: "Trend", user: current_user)
---
INSERT INTO "searches" ("query", "trend_or_location", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["query", "cats"], ["trend_or_location", "t"], ["user_id", 1]]